BAS BMEKZU Project/src/DataProcessors/скEDI_МониторРегламентныхЗаданий/скEDI_МониторРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>скEDI_МониторРегламентныхЗаданий</name>
</mdclass:DataProcessor>

BAS BMEKZU Project/src/Enums/скEDI_ВидыОперацийРегламентныхЗаданий/скEDI_ВидыОперацийРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ВидыОперацийРегламентныхЗаданий</name>
  <enumValues>
    <name>ПолучениеВходящихСообщений</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаИсходящихДокументов</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияНалоговыхДокументов</name>
  </enumValues>
  <enumValues>
    <name>СверкаНалоговыхДокументовЕРНН</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЗарегистрированныхНалоговыхДокументовКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/DataProcessors/скEDI_МониторРегламентныхЗаданий/ManagerModule.bsl
Функция ПолучитьТипРегламентногоЗаданияПоВидуОперации(ВидОперации) Экспорт
	Если ВидОперации = Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ПолучениеВходящихСообщений Тогда
		Возврат Метаданные.РегламентныеЗадания.скEDI_ПолучениеВходящихСообщений;
	ИначеЕсли ВидОперации = Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ОбработкаИсходящихДокументов Тогда
		Возврат Метаданные.РегламентныеЗадания.скEDI_ОтправкаДокументов;
	ИначеЕсли ВидОперации = Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.РегистрацияНалоговыхДокументов Тогда
		Возврат Метаданные.РегламентныеЗадания.скEDI_РегистрацияНалоговыхДокументов;
	ИначеЕсли ВидОперации = Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ОтправкаЗарегистрированныхНалоговыхДокументовКонтрагенту Тогда
		Возврат Метаданные.РегламентныеЗадания.скEDI_ОтправкаЗарегистрированныхНалоговыхДокументовКонтрагенту;
	ИначеЕсли ВидОперации = Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.СверкаНалоговыхДокументовЕРНН Тогда
		Возврат Метаданные.РегламентныеЗадания.скEDI_СверкаНалоговыхДокументовЕРНН;
	ИначеЕсли ВидОперации = Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН Тогда
		Возврат Метаданные.РегламентныеЗадания.скEDI_ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьВидОперацииПоТипуРегламентногоЗадания(ТипРегламентногоЗадания) Экспорт
	Если ТипРегламентногоЗадания = Метаданные.РегламентныеЗадания.скEDI_ПолучениеВходящихСообщений Тогда
		Возврат Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ПолучениеВходящихСообщений;
	ИначеЕсли ТипРегламентногоЗадания = Метаданные.РегламентныеЗадания.скEDI_ОтправкаДокументов Тогда
		Возврат Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ОбработкаИсходящихДокументов;
	ИначеЕсли ТипРегламентногоЗадания = Метаданные.РегламентныеЗадания.скEDI_РегистрацияНалоговыхДокументов Тогда
		Возврат Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.РегистрацияНалоговыхДокументов;
	ИначеЕсли ТипРегламентногоЗадания = Метаданные.РегламентныеЗадания.скEDI_ОтправкаЗарегистрированныхНалоговыхДокументовКонтрагенту Тогда
		Возврат Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ОтправкаЗарегистрированныхНалоговыхДокументовКонтрагенту;
	ИначеЕсли ТипРегламентногоЗадания = Метаданные.РегламентныеЗадания.скEDI_СверкаНалоговыхДокументовЕРНН Тогда
		Возврат Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.СверкаНалоговыхДокументовЕРНН;
	ИначеЕсли ТипРегламентногоЗадания = Метаданные.РегламентныеЗадания.скEDI_ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН Тогда
		Возврат Перечисления.скEDI_ВидыОперацийРегламентныхЗаданий.ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
